Source: https://www.kaggle.com/datasets/vinicius150987/titanic3
- survival-Survival(0= No;1=Yes)
- class-Passenger Class(1=1st;2=2nd;3=3rd)
- name-Name
- sex-Sex
- age-Age
- sibsp-Number of Siblings/Spouses Aboard
- parch-Number of Parents/Children board
- ticket-Ticket Number
- fare-Passenger Fare
- cabin-Cabin
- embarked-Port of Embarkation(C=Cherbourg;Q=Queenstown;S=Southampton)
- boat-Lifeboat(if survived)
- body-Body number(if not survived and body was recovered)

In [2]:
import pandas as pd

In [20]:
titanic = pd.read_excel('titanic3.xls', 
                        usecols=['name', 'sex', 'age', 'pclass', 'fare'],
                        index_col='name')
titanic

,pclass,sex,age,fare
name,,,,
"Allen, Miss. Elisabeth Walton",1,female,29.0000,211.3375
"Allison, Master. Hudson Trevor",1,male,0.9167,151.5500
"Allison, Miss. Helen Loraine",1,female,2.0000,151.5500
"Allison, Mr. Hudson Joshua Creighton",1,male,30.0000,151.5500
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,female,25.0000,151.5500
...,...,...,...,...
"Zabour, Miss. Hileni",3,female,14.5000,14.4542
"Zabour, Miss. Thamine",3,female,NaN,14.4542
"Zakarian, Mr. Mapriededer",3,male,26.5000,7.2250
"Zakarian, Mr. Ortin",3,male,27.0000,7.2250
"Zimmerman, Mr. Leo",3,male,29.0000,7.8750

In [21]:
titanic.iloc[0] # Select the row with index of 0

In [22]:
titanic.iloc[0:6]

,pclass,sex,age,fare
name,,,,
"Allen, Miss. Elisabeth Walton",1,female,29.0000,211.3375
"Allison, Master. Hudson Trevor",1,male,0.9167,151.5500
"Allison, Miss. Helen Loraine",1,female,2.0000,151.5500
"Allison, Mr. Hudson Joshua Creighton",1,male,30.0000,151.5500
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,female,25.0000,151.5500
"Anderson, Mr. Harry",1,male,48.0000,26.5500

In [24]:
titanic.iloc[[200, 300, 400]]

,pclass,sex,age,fare
name,,,,
"McCaffry, Mr. Thomas Francis",1,male,46.0,75.2417
"Van der hoef, Mr. Wyckoff",1,male,61.0,33.5000
"Drew, Mrs. James Vivian (Lulu Thorne Christian)",2,female,34.0,32.5000

In [25]:
titanic.iloc[5, 3] # Index position -> column position

26.55

In [26]:
titanic.iloc[[4, 5, 6], 3] # Select age for passengers 4, 5, 6

In [28]:
titanic.iloc[5, [0, 1, 2]] # Select columns [0, 1, 2] for passenger 5

In [29]:
titanic.iloc[[4, 5, 6], [0, 1, 2]] # Select columns [0, 1, 2] for passengers 4, 5, 6

,pclass,sex,age
name,,,
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,female,25.0
"Anderson, Mr. Harry",1,male,48.0
"Andrews, Miss. Kornelia Theodosia",1,female,63.0

In [30]:
titanic.iloc[:, [0, 1, 2]] # Select columns [0, 1, 2] for all the passengers

,pclass,sex,age
name,,,
"Allen, Miss. Elisabeth Walton",1,female,29.0000
"Allison, Master. Hudson Trevor",1,male,0.9167
"Allison, Miss. Helen Loraine",1,female,2.0000
"Allison, Mr. Hudson Joshua Creighton",1,male,30.0000
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,female,25.0000
...,...,...,...
"Zabour, Miss. Hileni",3,female,14.5000
"Zabour, Miss. Thamine",3,female,NaN
"Zakarian, Mr. Mapriededer",3,male,26.5000
"Zakarian, Mr. Ortin",3,male,27.0000
"Zimmerman, Mr. Leo",3,male,29.0000